Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: This amount will be fully sourced from existing departmental resources.
fr_fr: entièrement des ressources ministérielles existantes.

source: The government will also explore options for the National Research Council of Canada's Canadian
fr_fr: De plus, le gouvernement examinera des options pour le Centre de fabrication pour la photonique du

source: Photonics Fabrication Centre to best position it to attract private capital, scale its operations,
fr_fr: Centre national de recherches Canada afin qu'il puisse attirer des capitaux privés, élargir ses

source: and serve as a platform for Canadian innovation and new photonic applications, including in the face
fr_fr: activités et servir de catalyseur pour l'innovation au Canada et le développement de nouvelles

source: of the rise of AI and related compute infrastructure.
fr_fr: applications photoniques, notamment devant l'importance grandissante de l'IA et de l'infrastructure de calcul connexe.

source: Investing Where It Counts: Economic Benefits of AI and Quantum
fr_fr: Investir là où ça compte : les retombées économiques de l'IA et des technologies quantiques

source: AI has the potential to revolutionise business processes in all manner of industries,
fr_fr: L'IA pourrait révolutionner les méthodes de travail dans toutes sortes de secteurs,

source: allowing for increased automation and significant increases in productivity.
fr_fr: en donnant lieu à une automatisation accrue et à de fortes hausses de la

source: The OECD
fr_fr: productivité.

source: estimates that adoption of AI adoption could raise productivity growth by
fr_fr: de 1,1 point de pourcentage par année la croissance de la productivité au

source: 1.1 percentage points annually over the next 10 years.
fr_fr: cours des 10 prochaines années.

source: Quantum is a similarly
fr_fr: L'informatique quantique est une technologie

source: transformative technology: computing problems that are currently considered to be
fr_fr: résoudre des problèmes actuellement considérés comme insolubles par les ordinateurs

source: intractable even with the most powerful classical computers could be solved using quantum
fr_fr: classiques, même les plus puissants, y compris dans des domaines comme la

source: computers, including in such areas as cybersecurity, finance, and logistics.
fr_fr: cybersécurité, les finances et la logistique.

source: Countries that lead in game-changing technologies such as these can unlock significant
fr_fr: Les pays chefs de file dans des technologies qui changent la donne comme celles-ci

source: economic benefits through commercialising the associated intellectual property and being
fr_fr: propriété intellectuelle qui s'y rattache et de leur rôle de précurseur dans leur

source: among the first to put it to use.
fr_fr: utilisation.

source: With an investment of $925.6 million over five years to build a large-scale sovereign
fr_fr: En investissant 925,6 millions de dollars sur cinq ans pour bâtir une

source: compute capacity, Budget 2025 is providing AI infrastructure to further support
fr_fr: infrastructure de calcul souveraine à grande échelle, le budget de 2025 met en

source: sovereign AI capacity in Canada and ensure a successful Canadian AI ecosystem.
fr_fr: au Canada et assurer la réussite de l'écosystème canadien de l'IA.

source: Budget 2025 also proposes to provide, through the Defence Industrial Strategy,
fr_fr: Le budget de 2025 propose aussi de consacrer 334,3 millions de dollars sur

source: $334.3 million over five years to strengthen Canada's quantum ecosystem.
fr_fr: cinq ans au renforcement de l'écosystème canadien des technologies quantiques,

source: This fall, the government launched consultations to inform the next chapter of Canada's AI
fr_fr: À l'automne, le gouvernement a lancé des consultations pour guider le prochain volet

source: leadership and will develop a new AI strategy by the end of 2025.
fr_fr: du leadership canadien en matière d'IA et il mettra au point une nouvelle stratégie en matière d'IA d'ici la fin de 2025.

source: The government will
fr_fr: Le gouvernement déterminera aussi si de

source: also consider whether new AI incentives and supports should be provided.
fr_fr: nouveaux incitatifs et soutiens à l'IA devraient être fournis.

source: Protecting Canadian Intellectual Property
fr_fr: Protéger la propriété intellectuelle du Canada

source: Intellectual property output and ownership is central to Canada's innovation agenda.
fr_fr: Les produits et les droits de propriété intellectuelle sont au cœur du programme d'innovation du

source: Clear pathways
fr_fr: Canada.

source: to generate and retain intellectual property in Canada and transparency in the intellectual property
fr_fr: claires régissant la création et la conservation de la propriété intellectuelle au pays, et pour

source: system are essential to Canada's innovators and academic community.
fr_fr: assurer la transparence du système de propriété intellectuelle.

source: To ensure Canada's innovation ecosystem is equipped to protect Canadian intellectual property, and
fr_fr: Pour veiller à ce que l'écosystème canadien de l'innovation soit en mesure de protéger la propriété

source: support Canadian SMEs to commercialise and leverage their intangible assets to compete in the global
fr_fr: intellectuelle au pays et pour aider les petites et moyennes entreprises à commercialiser leurs

source: marketplace:
fr_fr: actifs immatériels et à en tirer profit afin de soutenir la concurrence sur le marché mondial, le

source: Budget 2025 proposes to provide $84.4 million over four years,
fr_fr: gouvernement propose ce qui suit dans le budget de 2025 :

source: starting in 2026-27, to Innovation, Science and Economic Development Canada to extend
fr_fr: de 2026-2027, à Innovation, Sciences et Développement économique Canada pour prolonger le

source: the Elevate IP program, as well as $22.5 million over three years, starting
fr_fr: programme ÉleverlaPI, ainsi que 22,5 millions de dollars sur trois ans, à compter

source: in 2026-27, to renew support for the Innovation Asset Collective's Patent Collective.
fr_fr: de 2026-2027, pour renouveler l'appui du portefeuille de brevets du Collectif d'actifs en innovation.

source: Budget 2025 proposes to provide $75 million over three years,
fr_fr: Accorder la somme de 75 millions de dollars sur trois ans, à compter

source: starting in 2026-27, to the National Research Council to extend the IP Assist Program.
fr_fr: de 2026-2027, au Conseil national de recherches pour prolonger l'initiative Assistance PI.

source: To further strengthen the intellectual property ecosystem in Canada, the government will conduct an
fr_fr: Pour renforcer l'écosystème de propriété intellectuelle au Canada, le gouvernement mènera un examen

source: intellectual property performance review to identify new ways to partner with emerging and scaling
fr_fr: partenariats avec des entreprises émergentes et en croissance à forte intensité de propriété intellectuelle.

source: intellectual property-intensive firms, increase domestic investment in leading and high-potential
fr_fr: entreprises de pointe et à potentiel élevé, à conserver et à commercialiser la propriété

source: firms, retain and commercialise intellectual property in Canada, and help firms to protect and
fr_fr: intellectuelle au Canada, et à aider les entreprises à protéger et à commercialiser leur propriété

source: commercialise their intellectual property in foreign markets to advance trade diversification.
fr_fr: intellectuelle sur les marchés étrangers pour favoriser la diversification commerciale.

source: Finally, the government is committed to improving legal certainty and transparency in the
fr_fr: En dernier lieu, le gouvernement est déterminé à améliorer la certitude et la transparence juridiques

source: intellectual property system to help facilitate more intellectual property-backed lending and limit
fr_fr: du système de propriété intellectuelle pour faciliter davantage de prêts reposant sur la propriété

source: abusive behaviour.
fr_fr: intellectuelle et limiter les comportements abusifs.

source: Investing to Build High-Growth Companies and Emerging Fund Managers
fr_fr: Investir dans les entreprises à forte croissance et les nouveaux gestionnaires de fonds

source: Investing in Canada's venture capital sector is essential to empowering entrepreneurs with the
fr_fr: Il est essentiel d'investir dans le secteur du capital de risque au Canada afin que les entrepreneurs

source: capital and networks they need to launch and scale resilient, high-impact companies.
fr_fr: résilientes et à fortes retombées, et en élargir les activités.

source: These venture
fr_fr: Les fonds de capital de risque

source: funds drive innovation and are shaping the next generation of Canadian anchor firms and fund
fr_fr: soutiennent l'innovation et façonnent la prochaine génération d'entreprises phares et de

source: managers that will support economic growth and strengthen Canada's economic resilience.
fr_fr: gestionnaires de fonds au Canada qui renforceront la croissance et la résilience économiques au pays.

source: To better align with emerging priorities, Budget 2025 proposes to realign previous venture
fr_fr: Pour mieux tenir compte des nouvelles priorités, le budget de 2025 propose de réajuster les

source: capital and mid-cap commitments to support access to capital that meets current market needs.
fr_fr: engagements antérieurs concernant le capital de risque et les entreprises à capitalisation moyenne,

source: Budget 2025 proposes to provide $1 billion on a cash basis
fr_fr: Le budget de 2025 propose d'accorder 1 milliard de dollars, selon la comptabilité de

source: over three years, starting in 2026-27, for the Business Development Bank of Canada to
fr_fr: caisse sur trois ans à compter de 2026–2027, à la Banque de développement du Canada pour

source: launch the new Venture and Growth Capital Catalyst Initiative , a
fr_fr: qu'elle lance la nouvelle Initiative de catalyse du capital de risque et de

source: fund-of-funds that would leverage more private venture capital by incentivising pension
fr_fr: croissance , un fonds de fonds qui mobilisera plus de capital de risque privé en

source: funds and other institutional investor participation.
fr_fr: encourageant la participation des fonds de pension et d'autres investisseurs institutionnels.

source: The initiative will also support new
fr_fr: Cette initiative soutiendra aussi de nouveaux gestionnaires de fonds et des secteurs clés comme

source: and emerging fund managers and important sectors such as the life sciences sector.
fr_fr: les sciences de la vie.

source: Strategic investment is essential to bolster innovation and drive
fr_fr: Il est essentiel de réaliser des investissements stratégiques pour stimuler l'innovation et

source: long-term growth.
fr_fr: générer de la croissance à long terme.

source: Budget 2025 announces the government's intention to develop a
fr_fr: Le gouvernement annonce dans le budget de 2025 qu'il

source: strategy to support Canadian firms facing early growth-stage funding gaps, and proposes to
fr_fr: compte élaborer une stratégie pour aider les entreprises canadiennes aux prises avec un manque

source: provide $750 million, on a cash basis, in support of those firms.
fr_fr: de financement aux premières étapes de croissance. Il est donc proposé de fournir à ces

source: Details on the
fr_fr: caisse.

source: strategy will be announced in 2026.
fr_fr: Des détails sur cette stratégie seront communiqués en 2026.

source: 2026-2028 Immigration Levels Plan
fr_fr: Plan des niveaux d'immigration 2026-2028

source: Throughout Canada's history, we have welcomed people from around the world—those fleeing persecution,
fr_fr: Tout au long de l'histoire du Canada, nous avons accueilli des gens des quatre coins du monde,

source: war and strife, those seeking to work hard and build a better life for their families, those seeking
fr_fr: voulaient travailler fort et offrir une meilleure vie à leurs familles ou qui souhaitaient faire des

source: to study at our world-class universities, experts wanting to drive innovation in Canada.
fr_fr: études dans nos universités de calibre mondial, ou bien des spécialistes qui visaient à stimuler

source: The fabric
fr_fr: l'innovation au Canada.

source: of our nation is woven with this tradition.
fr_fr: Cette tradition fait partie intégrante de notre pays.

source: As we have welcomed the world, we had the promise that if someone came to Canada they would
fr_fr: En ouvrant les bras à toutes ces personnes, notre promesse était que les personnes qui viendraient

source: contribute to our prosperity, and in return they would get all Canada offered—a country that is
fr_fr: s'établir au Canada contribueraient à notre prospérité, en échange de tout ce que le pays avait à

source: generous, fair, and diverse.
fr_fr: offrir, en tant que nation généreuse, équitable et diversifiée.

source: Our immigration system was built to standardise and evaluate newcomers so that admission was based on
fr_fr: Notre système d'immigration était conçu pour normaliser et évaluer les nouveaux arrivants afin que

source: a person's merits.
fr_fr: Avec le temps, ce système a évolué : sa

source: Over time, this system has evolved—its complexity has grown and its efficiency
fr_fr: complexité s'est accrue tandis que son efficacité s'est affaiblie.

source: has waned.
fr_fr: Au cours des dernières années, le

source: In recent years, the system became even harder to manage and less functional, and the
fr_fr: système est devenu encore plus difficile à gérer et moins fonctionnel, et le rythme des arrivées a

source: pace of arrivals began to exceed Canada's capacity to absorb and support newcomers in the way we are
fr_fr: commencé à dépasser la capacité habituelle du Canada à absorber et à soutenir les nouveaux

source: used to doing.
fr_fr: arrivants.

source: In 2018, 3.3 per cent of Canada's population were temporary residents.
fr_fr: En 2018, les résidents temporaires représentaient 3,3 % de la population

source: By 2024, that
fr_fr: canadienne.

source: number had more than doubled to 7.5 per cent, an unprecedented rate of growth that
fr_fr: En 2024, ce chiffre avait plus que doublé, atteignant 7,5 %, soit un taux

source: put pressure on housing supply, the healthcare system, and schools.
fr_fr: de croissance sans précédent qui a exercé des pressions sur l'offre de logements, le système de santé et les écoles.

source: Canada's new government
fr_fr: Le nouveau gouvernement du Canada reconnaît que ce système n'est plus viable,

source: recognises that this system is no longer sustainable, and we are determined to make it so, for
fr_fr: mais nous sommes déterminés à faire en sorte qu'il le soit, et ce, pour toutes les personnes qui

source: everyone who lives in and comes to this country.
fr_fr: vivent au pays ou qui viennent s'y établir.

source: We are taking back control over the immigration system and putting Canada on a trajectory to bring
fr_fr: Nous reprenons le contrôle du système d'immigration et nous plaçons le pays sur une trajectoire qui

source: immigration back to sustainable levels—allowing us to fulfill the promise of Canada to those who
fr_fr: ramènera l'immigration à des niveaux acceptables, ce qui nous permettra de remplir la promesse faite

source: call it home.
fr_fr: par le Canada aux personnes qui s'y sont établies.

source: At the same time, Canada will continue its long tradition of welcoming those fleeing
fr_fr: Parallèlement, le Canada poursuivra sa longue

source: violence, persecution and displacement.
fr_fr: tradition d'accueil des personnes qui fuient la violence et la persécution ou qui sont soumises à des déplacements.

source: The results of the government's focus are already becoming apparent.
fr_fr: Nous constatons déjà les résultats de l'engagement du gouvernement à cet égard.

source: Asylum claims are down by a
fr_fr: Les demandes d'asile ont baissé d'un tiers et le nombre de nouveaux travailleurs étrangers temporaires a baissé d'environ

source: third, and new temporary foreign worker arrivals are down by approximately 50 per cent
fr_fr: 50 % cette année.

source: this year. New international student arrivals have also declined by approximately
fr_fr: Les arrivées de nouveaux étudiants internationaux ont également diminué

source: 60 per cent compared to 2024.
fr_fr: d'environ 60 % par rapport à 2024.

source: This is a start, but we recognise there is more work to
fr_fr: C'est là un début, mais nous reconnaissons qu'il reste

source: do.
fr_fr: encore du travail à faire.

source: Budget 2025 announces that the 2026-2028 Immigration Levels
fr_fr: Le budget de 2025 annonce que le Plan des niveaux

source: Plan will stabilise permanent resident admission targets at 380,000 per year
fr_fr: permanents, qui seront maintenues à 380 000 par année pendant trois ans, comparativement à

source: for three years, down from 395,000 in 2025, while increasing the share of economic
fr_fr: 395 000 en 2025, tout en faisant passer la proportion de migrants économiques

source: migrants from 59 per cent to 64 per cent.
fr_fr: de 59 % à 64 %.

source: The new plan will also reduce the target for new temporary resident admissions from 673,650 in 2025
fr_fr: Le nouveau plan réduira également la cible d'admissions de

source: to 385,000 in 2026, and 370,000 in 2027 and 2028.
fr_fr: nouveaux résidents temporaires à 385 000 en 2026 et à 370 000 en 2027 et

source: The fiscal cost of this
fr_fr: Le coût financier de cette

source: measure is $168.2 million over four years, starting in 2026-27, and
fr_fr: mesure s'établit à 168,2 millions de dollars sur quatre ans, à compter de 2026-2027,

source: $35.7 million ongoing.
fr_fr: Ces coûts représentent principalement

source: These costs primarily represent the net loss in fee revenue,
fr_fr: la perte nette de revenus liés aux frais perçus, attribuable à la diminution du nombre

source: driven by fewer temporary resident admissions.
fr_fr: d'admissions de résidents temporaires.

source: The government recognises the role temporary foreign workers play in some sectors of
fr_fr: Le gouvernement reconnaît le rôle que jouent les travailleurs étrangers temporaires dans

source: the economy and in some parts of the country.
fr_fr: certains secteurs de l'économie et dans certaines parties du pays.

source: To that end, the 2026-2028 Immigration
fr_fr: À cette fin, le Plan des

source: Levels Plan will consider industries and sectors impacted by tariffs and the unique
fr_fr: niveaux d'immigration 2026-2028 tiendra compte des industries et des secteurs touchés par les

source: needs of rural and remote communities.
fr_fr: droits de douane ainsi que des besoins propres aux communautés rurales et éloignées.

source: In addition, Budget 2025 proposes a one-time initiative to
fr_fr: De plus, le budget de 2025 propose de mettre sur pied une initiative unique visant à

source: recognise eligible Protected Persons in Canada as permanent residents over the next two
fr_fr: accorder le statut de résident permanent à des personnes protégées admissibles au cours des

source: This practical step is a reflection of the fact that the vast majority of these
fr_fr: Il s'agit d'une mesure pratique qui tient compte du fait que la

source: people cannot return to the country of their origin.
fr_fr: vaste majorité de ces personnes ne peuvent retourner dans leur pays d'origine.

source: It will also ensure that those in
fr_fr: La mesure

source: genuine need of Canada's protection have their permanent status recognized, accelerating
fr_fr: garantirait également que les personnes ayant véritablement besoin de la protection du Canada

source: their full integration into the Canadian society and their path to citizenship.
fr_fr: personnes à la société canadienne ainsi que l'obtention de la citoyenneté.

source: The fiscal
fr_fr: Le coût budgétaire de

source: cost of this measure is $120.4 million over four years, starting in 2026-27.
fr_fr: cette mesure est de 120,4 millions de dollars sur quatre ans, à compter

source: represents the costs for Immigration, Refugees and Citizenship Canada and the Canada Border
fr_fr: Le financement permettra à Immigration, Réfugiés et Citoyenneté Canada et à

source: Services Agency to process the additional applications, which are partially offset by higher
fr_fr: l'Agence des services frontaliers du Canada de traiter les demandes supplémentaires, dont le

source: fee revenues.
fr_fr: coût est en partie compensé par la hausse des revenus liés aux frais perçus.

source: Budget 2025 also proposes to undertake a one-time measure to
fr_fr: Le budget de 2025 propose aussi une mesure ponctuelle pour accélérer la transition,

source: accelerate the transition of up to 33,000 work permit holders to permanent residency
fr_fr: en 2026 et 2027, d'au plus 33 000 travailleurs titulaires d'un permis de travail

source: in 2026 and 2027.
fr_fr: vers la résidence permanente.

source: These workers have established strong roots in their communities, are
fr_fr: Ces personnes ont tissé des liens forts dans leur communauté;

source: paying taxes, and are helping to build the strong economy Canada needs.
fr_fr: elles paient de l'impôt et elles aident à bâtir l'économie forte dont le Canada a besoin.

source: The fiscal cost of
fr_fr: Le

source: this measure is $19.4 million over four years, starting in 2026-27.
fr_fr: coût budgétaire de cette mesure est de 19,4 millions sur quatre ans, à compter

source: This also
fr_fr: de 2026-2027.

source: represents the costs for Immigration, Refugees and Citizenship Canada and other departments
fr_fr: Le financement permettra aussi à Immigration, Réfugiés et Citoyenneté Canada

source: to process the additional applications, which are partially offset by higher fee revenues.
fr_fr: et à d'autres ministères de traiter les demandes supplémentaires, dont le coût est en partie

source: These targets keep permanent resident arrivals at less than one per cent of the population
fr_fr: Ces cibles maintiennent le nombre d'arrivées de résidents permanents à moins de 1 % de la

source: beyond 2027 and will reduce the total number of temporary residents to less than five per cent
fr_fr: population canadienne après 2027 et réduiront le nombre total de résidents temporaires à moins

source: of Canada's population by the end of 2027.
fr_fr: de 5 % de la population du Canada d'ici la fin de 2027.

source: Our plan will restore control, clarity, and consistency to the immigration system, while maintaining
fr_fr: Au moyen de notre plan, le système d'immigration redeviendra clair, cohérent et en contrôle, tout en

source: compassion in our choices and driving competitiveness in our economy.
fr_fr: nous permettant de continuer de faire des choix avec compassion et en stimulant la compétitivité

source: Additional details on the 2026-2028 Immigration Levels Plan will be provided when the Minister of
fr_fr: Plus de renseignements sur le Plan des niveaux d'immigration 2026-2028 seront fournis lorsque la

source: Immigration, Refugees and Citizenship tables the 2025 Annual Report to Parliament on Immigration.
fr_fr: ministre de l'Immigration, des Réfugiés et de la Citoyenneté déposera le Rapport annuel au Parlement

source: Temporary Resident Admissions 2026 – 2028
fr_fr: sur l'immigration de 2025.

source: Improving Foreign Credential Recognition
fr_fr: Améliorer la reconnaissance des titres de compétences étrangers

source: Many newcomers to Canada already have extensive training in sectors where we are experiencing labour
fr_fr: De nombreux nouveaux arrivants au Canada sont déjà bien formés dans des secteurs où il manque de
